# Q1. List any five functions of the pandas library with execution.

# Answer :->

### Here are five functions from the pandas library along with their execution:

## 1. read_csv(): Reads a CSV file into a DataFrame.

In [1]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

## 2. head(): Displays the first few rows of a DataFrame.

In [4]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## 3. info(): Provides a concise summary of a DataFrame, including data types and non-null counts.

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

## 4. describe(): Generates descriptive statistics of a DataFrame.

In [6]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

## 5.  tail(): Displays the last few rows of a DataFrame.bydefault this will display five rows.

In [9]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

# Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

# Answer :->

In [10]:
# Sample DataFrame
data = {
    'A': [10, 20, 30, 40],
    'B': [50, 60, 70, 80],
    'C': [90, 100, 110, 120]
}

df = pd.DataFrame(data)

In [11]:
def reindex_with_increment(df):
    # Resetting the index to default (0, 1, 2, ...)
    df.reset_index(drop=True, inplace=True)
    
    # Creating a new index starting from 1 and incrementing by 2
    new_index = pd.Series(range(1, len(df) * 2, 2))
    
    # Re-indexing the DataFrame with the new index
    df.index = new_index
    
    return df

In [12]:
result = reindex_with_increment(df)
print(result)

    A   B    C
1  10  50   90
3  20  60  100
5  30  70  110
7  40  80  120

## Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.
## For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.

# Answer:->

In [16]:
import pandas as pd

# Sample DataFrame
data = {
    'Values': [10, 20, 30, 40, 50]
}

df = pd.DataFrame(data)

def sum_first_three_values(df):
    # Extracting the 'Values' column and calculating the sum of the first three values
    first_three_sum = df['Values'].head(3).sum()
    
    # Printing the sum to the console
    print("Sum of the first three values:", first_three_sum)

# Call the function with your DataFrame
sum_first_three_values(df)

Sum of the first three values: 60

# Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

# Answer:->

In [17]:
import pandas as pd

# Sample DataFrame
data = {
    'Text': [
        'This is a sample text.',
        'Count the number of words.',
        'Pandas DataFrame operation.'
    ]
}

df = pd.DataFrame(data)

def add_word_count_column(df):
    # Function to count words in a text
    word_count = lambda text: len(text.split())
    
    # Create 'Word_Count' column by applying word_count function to 'Text' column
    df['Word_Count'] = df['Text'].apply(word_count)
    
    return df

# Call the function with your DataFrame
result = add_word_count_column(df)
print(result)

                          Text  Word_Count
0       This is a sample text.           5
1   Count the number of words.           5
2  Pandas DataFrame operation.           3

# Q5. How are DataFrame.size() and DataFrame.shape() different?

# Answer:->


### DataFrame.size and DataFrame.shape are different attributes of a pandas DataFrame:

### DataFrame.size: This attribute represents the total number of elements in the DataFrame. It calculates the size by multiplying the number of rows by the number of columns. Therefore, DataFrame.size returns a single integer value representing the total number of elements in the DataFrame.

### DataFrame.shape: This attribute returns a tuple representing the dimensions of the DataFrame. It returns a tuple in the format (number of rows, number of columns). It gives you a breakdown of the DataFrame's structure in terms of rows and columns, providing two separate values to denote the DataFrame's shape.

### In summary, DataFrame.size gives the total count of elements in the DataFrame, while DataFrame.shape gives a tuple representing the DataFrame's dimensions in terms of rows and columns.

# Q6. Which function of pandas do we use to read an excel file?

# Answer:->

In [19]:
# Reading an Excel file named 'data.xlsx' from the current directory
data = pd.read_excel('LUSID.xlsx')

# Displaying the first few rows of the DataFrame
data.head()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,Datetimes in LUSID,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,This sheet allows you to format datetimes for...,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,If you have any questions please visit our:,NaN,NaN,NaN,NaN,NaN,NaN

## Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.

## The username is the part of the email address that appears before the '@' symbol. For example, if theemail address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username' column.

# Answer :->

In [22]:
data = {
    'Email': [
        'user1@gmail.com',
        'anotheruser@gmail.com',
        'testuser@gmail.com',
        'datascience373@gmail.com',
        'wajid@gmail.com'
    ]
}

df = pd.DataFrame(data)

def extract_username(df):
    # Extracting username using split('@')
    df['Username'] = df['Email'].apply(lambda x: x.split('@')[0])
    
    return df

# Call the function with your DataFrame
result = extract_username(df)
print(result)

                      Email        Username
0           user1@gmail.com           user1
1     anotheruser@gmail.com     anotheruser
2        testuser@gmail.com        testuser
3  datascience373@gmail.com  datascience373
4           wajid@gmail.com           wajid

## Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The  function should return a new DataFrame that contains only the selected rows.
#### For example, if df contains the following values:
####   A B C
#### 0 3 5 1
#### 1 8 2 7
#### 2 6 9 4
#### 3 2 3 5
#### 4 9 1 2
## Your function should select the following rows: A B C
#### 1 8 2 7
#### 4 9 1 2
## The function should return a new DataFrame that contains only the selected rows.

# Answer :->

In [23]:
data = {
    'A': [3, 8, 6, 2, 9],
    'B': [5, 2, 9, 3, 1],
    'C': [1, 7, 4, 5, 2]
}

df = pd.DataFrame(data)

def filter_dataframe(df):
    # Filtering rows based on conditions
    filtered_df = df[(df['A'] > 5) & (df['B'] < 10)]
    
    return filtered_df

# Call the function with your DataFrame
result = filter_dataframe(df)
print(result)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

## Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.
## Answer:->

In [24]:
data = {
    'Values': [10, 20, 30, 40, 50]
}

df = pd.DataFrame(data)

def calculate_stats(df):
    # Calculating mean, median, and standard deviation
    mean_value = df['Values'].mean()
    median_value = df['Values'].median()
    std_deviation = df['Values'].std()
    
    return mean_value, median_value, std_deviation

# Call the function with your DataFrame
mean, median, std = calculate_stats(df)
print("Mean:", mean)
print("Median:", median)
print("Standard Deviation:", std)

Mean: 30.0
Median: 30.0
Standard Deviation: 15.811388300841896

## Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

## Answer :->

In [25]:
data = {
    'Date': pd.date_range(start='2023-01-01', periods=30),
    'Sales': [50, 60, 70, 65, 80, 75, 90, 85, 100, 95, 110, 105, 120, 115, 130, 125, 140, 135, 150, 145, 160, 155, 170, 165, 180, 175, 190, 185, 200, 195]
}

df = pd.DataFrame(data)

def calculate_moving_average(df):
    # Calculating moving average using a window of size 7
    df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()
    
    return df

# Call the function with your DataFrame
result = calculate_moving_average(df)
print(result[['Date', 'Sales', 'MovingAverage']])

         Date  Sales  MovingAverage
0  2023-01-01     50      50.000000
1  2023-01-02     60      55.000000
2  2023-01-03     70      60.000000
3  2023-01-04     65      61.250000
4  2023-01-05     80      65.000000
5  2023-01-06     75      66.666667
6  2023-01-07     90      70.000000
7  2023-01-08     85      75.000000
8  2023-01-09    100      80.714286
9  2023-01-10     95      84.285714
10 2023-01-11    110      90.714286
11 2023-01-12    105      94.285714
12 2023-01-13    120     100.714286
13 2023-01-14    115     104.285714
14 2023-01-15    130     110.714286
15 2023-01-16    125     114.285714
16 2023-01-17    140     120.714286
17 2023-01-18    135     124.285714
18 2023-01-19    150     130.714286
19 2023-01-20    145     134.285714
20 2023-01-21    160     140.714286
21 2023-01-22    155     144.285714
22 2023-01-23    170     150.714286
23 2023-01-24    165     154.285714
24 2023-01-25    180     160.714286
25 2023-01-26    175     164.285714
26 2023-01-27    190     170.714286
27 2023-01-28    185     174.285714
28 2023-01-29    200     180.714286
29 2023-01-30    195     184.285714

## Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column. For example, if df contains the following values:
Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05
Your function should create the following DataFrame:

Date Weekday
0 2023-01-01 Sunday
1 2023-01-02 Monday
2 2023-01-03 Tuesday
3 2023-01-04 Wednesday
4 2023-01-05 Thursday
The function should return the modified DataFrame.

# Answer :->

In [26]:
data = {
    'Date': pd.date_range(start='2023-01-01', periods=5)
}

df = pd.DataFrame(data)

def add_weekday_column(df):
    # Extracting weekday names from the 'Date' column
    df['Weekday'] = df['Date'].dt.day_name()
    
    return df

# Call the function with your DataFrame
result = add_weekday_column(df)
print(result)

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

## Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

## Answer :->

In [27]:
import pandas as pd

# Sample DataFrame
data = {
    'Date': pd.date_range(start='2023-01-01', periods=50)
}

df = pd.DataFrame(data)

def select_date_range(df):
    # Filtering rows based on date range
    filtered_df = df[(df['Date'] >= '2023-01-01') & (df['Date'] <= '2023-01-31')]
    
    return filtered_df

# Call the function with your DataFrame
result = select_date_range(df)
print(result)

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10
10 2023-01-11
11 2023-01-12
12 2023-01-13
13 2023-01-14
14 2023-01-15
15 2023-01-16
16 2023-01-17
17 2023-01-18
18 2023-01-19
19 2023-01-20
20 2023-01-21
21 2023-01-22
22 2023-01-23
23 2023-01-24
24 2023-01-25
25 2023-01-26
26 2023-01-27
27 2023-01-28
28 2023-01-29
29 2023-01-30
30 2023-01-31

## Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

## Answer :->

## To use the basic functions of pandas, we need to import the pandas library itself. The standard convention is to import pandas using the alias pd. Here's how you typically import pandas:

In [28]:
import pandas as pd

## Once imported, we can use the functionalities provided by pandas by referencing them through the pd alias. For instance, pd.DataFrame() creates a pandas DataFrame, pd.read_csv() reads a CSV file into a DataFrame, and so on.

# ------------------------------------------------ Thank You ----------------------------------------------------------